china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
#ifndef _REG_RC_H_
#define _REG_RC_H_

#include "co_int.h"
#include "_reg_rc.h"
#include "compiler.h"
#include "driver/entry/arch.h"      //lst
#include "reg_access.h"

#define REG_RC_COUNT 107

#define REG_RC_DECODING_MASK 0x000001FF

/**
 * @brief CNTL_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         FORCE_ENABLE   0
 *     30            SPI_RESET   0
 *  18:16             RC_STATE   0x0
 *     12        CH0_SHDN_STAT   0
 *     08               CH0_LD   0
 *     03                RC_EN   0
 *     00               CH0_EN   0
 * </pre>
 */
#define RC_CNTL_STAT_ADDR   0x01050000
#define RC_CNTL_STAT_OFFSET 0x00000000
#define RC_CNTL_STAT_INDEX  0x00000000
#define RC_CNTL_STAT_RESET  0x00000000

__INLINE uint32_t rc_cntl_stat_get(void)
{
    return REG_PL_RD(RC_CNTL_STAT_ADDR);
}

__INLINE void rc_cntl_stat_set(uint32_t value)
{
    REG_PL_WR(RC_CNTL_STAT_ADDR, value);
}

// field definitions
#define RC_FORCE_ENABLE_BIT     ((uint32_t)0x80000000)
#define RC_FORCE_ENABLE_POS     31
#define RC_SPI_RESET_BIT        ((uint32_t)0x40000000)
#define RC_SPI_RESET_POS        30
#define RC_RC_STATE_MASK        ((uint32_t)0x00070000)
#define RC_RC_STATE_LSB         16
#define RC_RC_STATE_WIDTH       ((uint32_t)0x00000003)
#define RC_CH0_SHDN_STAT_BIT    ((uint32_t)0x00001000)
#define RC_CH0_SHDN_STAT_POS    12
#define RC_CH0_LD_BIT           ((uint32_t)0x00000100)
#define RC_CH0_LD_POS           8
#define RC_RC_EN_BIT            ((uint32_t)0x00000008)
#define RC_RC_EN_POS            3
#define RC_CH0_EN_BIT           ((uint32_t)0x00000001)
#define RC_CH0_EN_POS           0

#define RC_FORCE_ENABLE_RST     0x0
#define RC_SPI_RESET_RST        0x0
#define RC_RC_STATE_RST         0x0
#define RC_CH0_SHDN_STAT_RST    0x0
#define RC_CH0_LD_RST           0x0
#define RC_RC_EN_RST            0x0
#define RC_CH0_EN_RST           0x0

__INLINE void rc_cntl_stat_pack(uint8_t forceenable, uint8_t spireset, uint8_t ch0ld, uint8_t rcen, uint8_t ch0en)
{
    ASSERT_ERR((((uint32_t)forceenable << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)spireset << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)ch0ld << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rcen << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)ch0en << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_CNTL_STAT_ADDR,  ((uint32_t)forceenable << 31) | ((uint32_t)spireset << 30) | ((uint32_t)ch0ld << 8) | ((uint32_t)rcen << 3) | ((uint32_t)ch0en << 0));
}

__INLINE void rc_cntl_stat_unpack(uint8_t *forceenable, uint8_t *spireset, uint8_t *rcstate, uint8_t *ch0shdnstat, uint8_t *ch0ld, uint8_t *rcen, uint8_t *ch0en)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);

    *forceenable = (localVal & ((uint32_t)0x80000000)) >> 31;
    *spireset = (localVal & ((uint32_t)0x40000000)) >> 30;
    *rcstate = (localVal & ((uint32_t)0x00070000)) >> 16;
    *ch0shdnstat = (localVal & ((uint32_t)0x00001000)) >> 12;
    *ch0ld = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rcen = (localVal & ((uint32_t)0x00000008)) >> 3;
    *ch0en = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rc_force_enable_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rc_force_enable_setf(uint8_t forceenable)
{
    ASSERT_ERR((((uint32_t)forceenable << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(RC_CNTL_STAT_ADDR, (REG_PL_RD(RC_CNTL_STAT_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forceenable << 31));
}

__INLINE uint8_t rc_spi_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void rc_spi_reset_setf(uint8_t spireset)
{
    ASSERT_ERR((((uint32_t)spireset << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_PL_WR(RC_CNTL_STAT_ADDR, (REG_PL_RD(RC_CNTL_STAT_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)spireset << 30));
}

__INLINE uint8_t rc_rc_state_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__INLINE uint8_t rc_ch0_shdn_stat_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE uint8_t rc_ch0_ld_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void rc_ch0_ld_setf(uint8_t ch0ld)
{
    ASSERT_ERR((((uint32_t)ch0ld << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_PL_WR(RC_CNTL_STAT_ADDR, (REG_PL_RD(RC_CNTL_STAT_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)ch0ld << 8));
}

__INLINE uint8_t rc_rc_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rc_rc_en_setf(uint8_t rcen)
{
    ASSERT_ERR((((uint32_t)rcen << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(RC_CNTL_STAT_ADDR, (REG_PL_RD(RC_CNTL_STAT_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)rcen << 3));
}

__INLINE uint8_t rc_ch0_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CNTL_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rc_ch0_en_setf(uint8_t ch0en)
{
    ASSERT_ERR((((uint32_t)ch0en << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_CNTL_STAT_ADDR, (REG_PL_RD(RC_CNTL_STAT_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)ch0en << 0));
}

/**
 * @brief BEKEN_SPI register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:28            PRESCALER   0x0
 *  27:00         TRX_REG_STAT   0x0
 * </pre>
 */
#define RC_BEKEN_SPI_ADDR   0x01050004
#define RC_BEKEN_SPI_OFFSET 0x00000004
#define RC_BEKEN_SPI_INDEX  0x00000001
#define RC_BEKEN_SPI_RESET  0x00000000

__INLINE uint32_t rc_beken_spi_get(void)
{
    return REG_PL_RD(RC_BEKEN_SPI_ADDR);
}

__INLINE void rc_beken_spi_set(uint32_t value)
{
    REG_PL_WR(RC_BEKEN_SPI_ADDR, value);
}

