china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
// field definitions
#define RC_PRESCALER_MASK      ((uint32_t)0xF0000000)
#define RC_PRESCALER_LSB       28
#define RC_PRESCALER_WIDTH     ((uint32_t)0x00000004)
#define RC_TRX_REG_STAT_MASK   ((uint32_t)0x0FFFFFFF)
#define RC_TRX_REG_STAT_LSB    0
#define RC_TRX_REG_STAT_WIDTH  ((uint32_t)0x0000001C)

#define RC_PRESCALER_RST       0x0
#define RC_TRX_REG_STAT_RST    0x0

__INLINE void rc_beken_spi_unpack(uint8_t *prescaler, uint32_t *trxregstat)
{
    uint32_t localVal = REG_PL_RD(RC_BEKEN_SPI_ADDR);

    *prescaler = (localVal & ((uint32_t)0xF0000000)) >> 28;
    *trxregstat = (localVal & ((uint32_t)0x0FFFFFFF)) >> 0;
}

__INLINE uint8_t rc_prescaler_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_BEKEN_SPI_ADDR);
    return ((localVal & ((uint32_t)0xF0000000)) >> 28);
}

__INLINE void rc_prescaler_setf(uint8_t prescaler)
{
    ASSERT_ERR((((uint32_t)prescaler << 28) & ~((uint32_t)0xF0000000)) == 0);
    REG_PL_WR(RC_BEKEN_SPI_ADDR, (uint32_t)prescaler << 28);
}

__INLINE uint32_t rc_trx_reg_stat_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_BEKEN_SPI_ADDR);
    return ((localVal & ((uint32_t)0x0FFFFFFF)) >> 0);
}

/**
 * @brief CH0_OUTPOWER register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00         CH0_OUTPOWER   0x0
 * </pre>
 */
#define RC_CH0_OUTPOWER_ADDR   0x01050014
#define RC_CH0_OUTPOWER_OFFSET 0x00000014
#define RC_CH0_OUTPOWER_INDEX  0x00000005
#define RC_CH0_OUTPOWER_RESET  0x00000000

__INLINE uint32_t rc_ch0_outpower_get(void)
{
    return REG_PL_RD(RC_CH0_OUTPOWER_ADDR);
}

__INLINE void rc_ch0_outpower_set(uint32_t value)
{
    REG_PL_WR(RC_CH0_OUTPOWER_ADDR, value);
}

// field definitions
#define RC_CH0_OUTPOWER_MASK   ((uint32_t)0x000000FF)
#define RC_CH0_OUTPOWER_LSB    0
#define RC_CH0_OUTPOWER_WIDTH  ((uint32_t)0x00000008)

#define RC_CH0_OUTPOWER_RST    0x0

__INLINE uint8_t rc_ch0_outpower_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_OUTPOWER_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief CH0_RX_ONOFF_DELAY register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16     CH0_RX_OFF_DELAY   0x0
 *  07:00      CH0_RX_ON_DELAY   0x0
 * </pre>
 */
#define RC_CH0_RX_ONOFF_DELAY_ADDR   0x01050020
#define RC_CH0_RX_ONOFF_DELAY_OFFSET 0x00000020
#define RC_CH0_RX_ONOFF_DELAY_INDEX  0x00000008
#define RC_CH0_RX_ONOFF_DELAY_RESET  0x00000000

__INLINE uint32_t rc_ch0_rx_onoff_delay_get(void)
{
    return REG_PL_RD(RC_CH0_RX_ONOFF_DELAY_ADDR);
}

__INLINE void rc_ch0_rx_onoff_delay_set(uint32_t value)
{
    REG_PL_WR(RC_CH0_RX_ONOFF_DELAY_ADDR, value);
}

// field definitions
#define RC_CH0_RX_OFF_DELAY_MASK   ((uint32_t)0x00FF0000)
#define RC_CH0_RX_OFF_DELAY_LSB    16
#define RC_CH0_RX_OFF_DELAY_WIDTH  ((uint32_t)0x00000008)
#define RC_CH0_RX_ON_DELAY_MASK    ((uint32_t)0x000000FF)
#define RC_CH0_RX_ON_DELAY_LSB     0
#define RC_CH0_RX_ON_DELAY_WIDTH   ((uint32_t)0x00000008)

#define RC_CH0_RX_OFF_DELAY_RST    0x0
#define RC_CH0_RX_ON_DELAY_RST     0x0

__INLINE void rc_ch0_rx_onoff_delay_pack(uint8_t ch0rxoffdelay, uint8_t ch0rxondelay)
{
    ASSERT_ERR((((uint32_t)ch0rxoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)ch0rxondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_RX_ONOFF_DELAY_ADDR,  ((uint32_t)ch0rxoffdelay << 16) | ((uint32_t)ch0rxondelay << 0));
}

__INLINE void rc_ch0_rx_onoff_delay_unpack(uint8_t *ch0rxoffdelay, uint8_t *ch0rxondelay)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_RX_ONOFF_DELAY_ADDR);

    *ch0rxoffdelay = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *ch0rxondelay = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rc_ch0_rx_off_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_RX_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rc_ch0_rx_off_delay_setf(uint8_t ch0rxoffdelay)
{
    ASSERT_ERR((((uint32_t)ch0rxoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(RC_CH0_RX_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_RX_ONOFF_DELAY_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)ch0rxoffdelay << 16));
}

__INLINE uint8_t rc_ch0_rx_on_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_RX_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rc_ch0_rx_on_delay_setf(uint8_t ch0rxondelay)
{
    ASSERT_ERR((((uint32_t)ch0rxondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_RX_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_RX_ONOFF_DELAY_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)ch0rxondelay << 0));
}

/**
 * @brief CH0_TX_ONOFF_DELAY register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16     CH0_TX_OFF_DELAY   0x0
 *  07:00      CH0_TX_ON_DELAY   0x0
 * </pre>
 */
#define RC_CH0_TX_ONOFF_DELAY_ADDR   0x0105002C
#define RC_CH0_TX_ONOFF_DELAY_OFFSET 0x0000002C
#define RC_CH0_TX_ONOFF_DELAY_INDEX  0x0000000B
#define RC_CH0_TX_ONOFF_DELAY_RESET  0x00000000

__INLINE uint32_t rc_ch0_tx_onoff_delay_get(void)
{
    return REG_PL_RD(RC_CH0_TX_ONOFF_DELAY_ADDR);
}

__INLINE void rc_ch0_tx_onoff_delay_set(uint32_t value)
{
    REG_PL_WR(RC_CH0_TX_ONOFF_DELAY_ADDR, value);
}

// field definitions
#define RC_CH0_TX_OFF_DELAY_MASK   ((uint32_t)0x00FF0000)
#define RC_CH0_TX_OFF_DELAY_LSB    16
#define RC_CH0_TX_OFF_DELAY_WIDTH  ((uint32_t)0x00000008)
#define RC_CH0_TX_ON_DELAY_MASK    ((uint32_t)0x000000FF)
#define RC_CH0_TX_ON_DELAY_LSB     0
#define RC_CH0_TX_ON_DELAY_WIDTH   ((uint32_t)0x00000008)

#define RC_CH0_TX_OFF_DELAY_RST    0x0
#define RC_CH0_TX_ON_DELAY_RST     0x0

__INLINE void rc_ch0_tx_onoff_delay_pack(uint8_t ch0txoffdelay, uint8_t ch0txondelay)
{
    ASSERT_ERR((((uint32_t)ch0txoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)ch0txondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_TX_ONOFF_DELAY_ADDR,  ((uint32_t)ch0txoffdelay << 16) | ((uint32_t)ch0txondelay << 0));
}

__INLINE void rc_ch0_tx_onoff_delay_unpack(uint8_t *ch0txoffdelay, uint8_t *ch0txondelay)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_TX_ONOFF_DELAY_ADDR);

    *ch0txoffdelay = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *ch0txondelay = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rc_ch0_tx_off_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_TX_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rc_ch0_tx_off_delay_setf(uint8_t ch0txoffdelay)
{
    ASSERT_ERR((((uint32_t)ch0txoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(RC_CH0_TX_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_TX_ONOFF_DELAY_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)ch0txoffdelay << 16));
}

__INLINE uint8_t rc_ch0_tx_on_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_TX_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rc_ch0_tx_on_delay_setf(uint8_t ch0txondelay)
{
    ASSERT_ERR((((uint32_t)ch0txondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_TX_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_TX_ONOFF_DELAY_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)ch0txondelay << 0));
}

/**
 * @brief CH0_PA_ONOFF_DELAY register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16     CH0_PA_OFF_DELAY   0x0
 *  07:00      CH0_PA_ON_DELAY   0x0
 * </pre>
 */
#define RC_CH0_PA_ONOFF_DELAY_ADDR   0x01050038
#define RC_CH0_PA_ONOFF_DELAY_OFFSET 0x00000038
#define RC_CH0_PA_ONOFF_DELAY_INDEX  0x0000000E
#define RC_CH0_PA_ONOFF_DELAY_RESET  0x00000000

__INLINE uint32_t rc_ch0_pa_onoff_delay_get(void)
{
    return REG_PL_RD(RC_CH0_PA_ONOFF_DELAY_ADDR);
}

__INLINE void rc_ch0_pa_onoff_delay_set(uint32_t value)
{
    REG_PL_WR(RC_CH0_PA_ONOFF_DELAY_ADDR, value);
}

