china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
__INLINE void rc_trx_reg7_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG7_ADDR, value);
}

// field definitions
#define RC_TRX_REG7_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG7_LSB    0
#define RC_TRX_REG7_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG7_RST    0x0

__INLINE uint32_t rc_trx_reg7_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG7_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg7_setf(uint32_t trxreg7)
{
    ASSERT_ERR((((uint32_t)trxreg7 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG7_ADDR, (uint32_t)trxreg7 << 0);
}

/**
 * @brief TRX_REG8 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG8   0x0
 * </pre>
 */
#define RC_TRX_REG8_ADDR   0x010500A0
#define RC_TRX_REG8_OFFSET 0x000000A0
#define RC_TRX_REG8_INDEX  0x00000028
#define RC_TRX_REG8_RESET  0x00000000

__INLINE uint32_t rc_trx_reg8_get(void)
{
    return REG_PL_RD(RC_TRX_REG8_ADDR);
}

__INLINE void rc_trx_reg8_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG8_ADDR, value);
}

// field definitions
#define RC_TRX_REG8_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG8_LSB    0
#define RC_TRX_REG8_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG8_RST    0x0

__INLINE uint32_t rc_trx_reg8_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG8_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg8_setf(uint32_t trxreg8)
{
    ASSERT_ERR((((uint32_t)trxreg8 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG8_ADDR, (uint32_t)trxreg8 << 0);
}

/**
 * @brief TRX_REG9 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG9   0x0
 * </pre>
 */
#define RC_TRX_REG9_ADDR   0x010500A4
#define RC_TRX_REG9_OFFSET 0x000000A4
#define RC_TRX_REG9_INDEX  0x00000029
#define RC_TRX_REG9_RESET  0x00000000

__INLINE uint32_t rc_trx_reg9_get(void)
{
    return REG_PL_RD(RC_TRX_REG9_ADDR);
}

__INLINE void rc_trx_reg9_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG9_ADDR, value);
}

// field definitions
#define RC_TRX_REG9_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG9_LSB    0
#define RC_TRX_REG9_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG9_RST    0x0

__INLINE uint32_t rc_trx_reg9_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG9_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg9_setf(uint32_t trxreg9)
{
    ASSERT_ERR((((uint32_t)trxreg9 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG9_ADDR, (uint32_t)trxreg9 << 0);
}

/**
 * @brief TRX_REG10 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG10   0x0
 * </pre>
 */
#define RC_TRX_REG10_ADDR   0x010500A8
#define RC_TRX_REG10_OFFSET 0x000000A8
#define RC_TRX_REG10_INDEX  0x0000002A
#define RC_TRX_REG10_RESET  0x00000000

__INLINE uint32_t rc_trx_reg10_get(void)
{
    return REG_PL_RD(RC_TRX_REG10_ADDR);
}

__INLINE void rc_trx_reg10_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG10_ADDR, value);
}

// field definitions
#define RC_TRX_REG10_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG10_LSB    0
#define RC_TRX_REG10_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG10_RST    0x0

__INLINE uint32_t rc_trx_reg10_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG10_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg10_setf(uint32_t trxreg10)
{
    ASSERT_ERR((((uint32_t)trxreg10 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG10_ADDR, (uint32_t)trxreg10 << 0);
}

/**
 * @brief TRX_REG11 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG11   0x0
 * </pre>
 */
#define RC_TRX_REG11_ADDR   0x010500AC
#define RC_TRX_REG11_OFFSET 0x000000AC
#define RC_TRX_REG11_INDEX  0x0000002B
#define RC_TRX_REG11_RESET  0x00000000

__INLINE uint32_t rc_trx_reg11_get(void)
{
    return REG_PL_RD(RC_TRX_REG11_ADDR);
}

__INLINE void rc_trx_reg11_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG11_ADDR, value);
}

// field definitions
#define RC_TRX_REG11_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG11_LSB    0
#define RC_TRX_REG11_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG11_RST    0x0

__INLINE uint32_t rc_trx_reg11_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG11_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg11_setf(uint32_t trxreg11)
{
    ASSERT_ERR((((uint32_t)trxreg11 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG11_ADDR, (uint32_t)trxreg11 << 0);
}

/**
 * @brief TRX_REG12 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG12   0x0
 * </pre>
 */
#define RC_TRX_REG12_ADDR   0x010500B0
#define RC_TRX_REG12_OFFSET 0x000000B0
#define RC_TRX_REG12_INDEX  0x0000002C
#define RC_TRX_REG12_RESET  0x00000000

__INLINE uint32_t rc_trx_reg12_get(void)
{
    return REG_PL_RD(RC_TRX_REG12_ADDR);
}

__INLINE void rc_trx_reg12_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG12_ADDR, value);
}

// field definitions
#define RC_TRX_REG12_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG12_LSB    0
#define RC_TRX_REG12_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG12_RST    0x0

__INLINE uint32_t rc_trx_reg12_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG12_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg12_setf(uint32_t trxreg12)
{
    ASSERT_ERR((((uint32_t)trxreg12 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG12_ADDR, (uint32_t)trxreg12 << 0);
}

/**
 * @brief TRX_REG13 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG13   0x0
 * </pre>
 */
#define RC_TRX_REG13_ADDR   0x010500B4
#define RC_TRX_REG13_OFFSET 0x000000B4
#define RC_TRX_REG13_INDEX  0x0000002D
#define RC_TRX_REG13_RESET  0x00000000

__INLINE uint32_t rc_trx_reg13_get(void)
{
    return REG_PL_RD(RC_TRX_REG13_ADDR);
}

__INLINE void rc_trx_reg13_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG13_ADDR, value);
}

