china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
// field definitions
#define RC_TRX_REG19_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG19_LSB    0
#define RC_TRX_REG19_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG19_RST    0x0

__INLINE uint32_t rc_trx_reg19_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG19_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg19_setf(uint32_t trxreg19)
{
    ASSERT_ERR((((uint32_t)trxreg19 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG19_ADDR, (uint32_t)trxreg19 << 0);
}

/**
 * @brief TRX_REG20 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG20   0x0
 * </pre>
 */
#define RC_TRX_REG20_ADDR   0x010500D0
#define RC_TRX_REG20_OFFSET 0x000000D0
#define RC_TRX_REG20_INDEX  0x00000034
#define RC_TRX_REG20_RESET  0x00000000

__INLINE uint32_t rc_trx_reg20_get(void)
{
    return REG_PL_RD(RC_TRX_REG20_ADDR);
}

__INLINE void rc_trx_reg20_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG20_ADDR, value);
}

// field definitions
#define RC_TRX_REG20_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG20_LSB    0
#define RC_TRX_REG20_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG20_RST    0x0

__INLINE uint32_t rc_trx_reg20_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG20_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg20_setf(uint32_t trxreg20)
{
    ASSERT_ERR((((uint32_t)trxreg20 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG20_ADDR, (uint32_t)trxreg20 << 0);
}

/**
 * @brief TRX_REG21 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG21   0x0
 * </pre>
 */
#define RC_TRX_REG21_ADDR   0x010500D4
#define RC_TRX_REG21_OFFSET 0x000000D4
#define RC_TRX_REG21_INDEX  0x00000035
#define RC_TRX_REG21_RESET  0x00000000

__INLINE uint32_t rc_trx_reg21_get(void)
{
    return REG_PL_RD(RC_TRX_REG21_ADDR);
}

__INLINE void rc_trx_reg21_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG21_ADDR, value);
}

// field definitions
#define RC_TRX_REG21_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG21_LSB    0
#define RC_TRX_REG21_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG21_RST    0x0

__INLINE uint32_t rc_trx_reg21_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG21_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg21_setf(uint32_t trxreg21)
{
    ASSERT_ERR((((uint32_t)trxreg21 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG21_ADDR, (uint32_t)trxreg21 << 0);
}

/**
 * @brief TRX_REG22 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG22   0x0
 * </pre>
 */
#define RC_TRX_REG22_ADDR   0x010500D8
#define RC_TRX_REG22_OFFSET 0x000000D8
#define RC_TRX_REG22_INDEX  0x00000036
#define RC_TRX_REG22_RESET  0x00000000

__INLINE uint32_t rc_trx_reg22_get(void)
{
    return REG_PL_RD(RC_TRX_REG22_ADDR);
}

__INLINE void rc_trx_reg22_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG22_ADDR, value);
}

// field definitions
#define RC_TRX_REG22_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG22_LSB    0
#define RC_TRX_REG22_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG22_RST    0x0

__INLINE uint32_t rc_trx_reg22_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG22_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg22_setf(uint32_t trxreg22)
{
    ASSERT_ERR((((uint32_t)trxreg22 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG22_ADDR, (uint32_t)trxreg22 << 0);
}

/**
 * @brief TRX_REG23 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG23   0x0
 * </pre>
 */
#define RC_TRX_REG23_ADDR   0x010500DC
#define RC_TRX_REG23_OFFSET 0x000000DC
#define RC_TRX_REG23_INDEX  0x00000037
#define RC_TRX_REG23_RESET  0x00000000

__INLINE uint32_t rc_trx_reg23_get(void)
{
    return REG_PL_RD(RC_TRX_REG23_ADDR);
}

__INLINE void rc_trx_reg23_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG23_ADDR, value);
}

// field definitions
#define RC_TRX_REG23_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG23_LSB    0
#define RC_TRX_REG23_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG23_RST    0x0

__INLINE uint32_t rc_trx_reg23_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG23_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg23_setf(uint32_t trxreg23)
{
    ASSERT_ERR((((uint32_t)trxreg23 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG23_ADDR, (uint32_t)trxreg23 << 0);
}

/**
 * @brief TRX_REG24 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG24   0x0
 * </pre>
 */
#define RC_TRX_REG24_ADDR   0x010500E0
#define RC_TRX_REG24_OFFSET 0x000000E0
#define RC_TRX_REG24_INDEX  0x00000038
#define RC_TRX_REG24_RESET  0x00000000

__INLINE uint32_t rc_trx_reg24_get(void)
{
    return REG_PL_RD(RC_TRX_REG24_ADDR);
}

__INLINE void rc_trx_reg24_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG24_ADDR, value);
}

// field definitions
#define RC_TRX_REG24_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG24_LSB    0
#define RC_TRX_REG24_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG24_RST    0x0

__INLINE uint32_t rc_trx_reg24_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG24_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg24_setf(uint32_t trxreg24)
{
    ASSERT_ERR((((uint32_t)trxreg24 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG24_ADDR, (uint32_t)trxreg24 << 0);
}

/**
 * @brief TRX_REG25 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG25   0x0
 * </pre>
 */
#define RC_TRX_REG25_ADDR   0x010500E4
#define RC_TRX_REG25_OFFSET 0x000000E4
#define RC_TRX_REG25_INDEX  0x00000039
#define RC_TRX_REG25_RESET  0x00000000

