china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
__INLINE void rc_rx_avg_i_rd_setf(uint16_t rxavgird)
{
    ASSERT_ERR((((uint32_t)rxavgird << 12) & ~((uint32_t)0x00FFF000)) == 0);
    REG_PL_WR(RC_RX_AVG_CALC_ADDR, (REG_PL_RD(RC_RX_AVG_CALC_ADDR) & ~((uint32_t)0x00FFF000)) | ((uint32_t)rxavgird << 12));
}

__INLINE uint16_t rc_rx_avg_q_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_AVG_CALC_ADDR);
    return ((localVal & ((uint32_t)0x00000FFF)) >> 0);
}

__INLINE void rc_rx_avg_q_rd_setf(uint16_t rxavgqrd)
{
    ASSERT_ERR((((uint32_t)rxavgqrd << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_RX_AVG_CALC_ADDR, (REG_PL_RD(RC_RX_AVG_CALC_ADDR) & ~((uint32_t)0x00000FFF)) | ((uint32_t)rxavgqrd << 0));
}

/**
 * @brief RX_CALIB_EN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31            RX_CAL_EN   0
 *     30           RX_COMP_EN   0
 *  23:12           RX_DC_I_RD   0x0
 *  11:00           RX_DC_Q_RD   0x0
 * </pre>
 */
#define RC_RX_CALIB_EN_ADDR   0x010500F8
#define RC_RX_CALIB_EN_OFFSET 0x000000F8
#define RC_RX_CALIB_EN_INDEX  0x0000003E
#define RC_RX_CALIB_EN_RESET  0x00000000

__INLINE uint32_t rc_rx_calib_en_get(void)
{
    return REG_PL_RD(RC_RX_CALIB_EN_ADDR);
}

__INLINE void rc_rx_calib_en_set(uint32_t value)
{
    REG_PL_WR(RC_RX_CALIB_EN_ADDR, value);
}

// field definitions
#define RC_RX_CAL_EN_BIT     ((uint32_t)0x80000000)
#define RC_RX_CAL_EN_POS     31
#define RC_RX_COMP_EN_BIT    ((uint32_t)0x40000000)
#define RC_RX_COMP_EN_POS    30
#define RC_RX_DC_I_RD_MASK   ((uint32_t)0x00FFF000)
#define RC_RX_DC_I_RD_LSB    12
#define RC_RX_DC_I_RD_WIDTH  ((uint32_t)0x0000000C)
#define RC_RX_DC_Q_RD_MASK   ((uint32_t)0x00000FFF)
#define RC_RX_DC_Q_RD_LSB    0
#define RC_RX_DC_Q_RD_WIDTH  ((uint32_t)0x0000000C)

#define RC_RX_CAL_EN_RST     0x0
#define RC_RX_COMP_EN_RST    0x0
#define RC_RX_DC_I_RD_RST    0x0
#define RC_RX_DC_Q_RD_RST    0x0

__INLINE void rc_rx_calib_en_pack(uint8_t rxcalen, uint8_t rxcompen, uint16_t rxdcird, uint16_t rxdcqrd)
{
    ASSERT_ERR((((uint32_t)rxcalen << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rxcompen << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)rxdcird << 12) & ~((uint32_t)0x00FFF000)) == 0);
    ASSERT_ERR((((uint32_t)rxdcqrd << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_RX_CALIB_EN_ADDR,  ((uint32_t)rxcalen << 31) | ((uint32_t)rxcompen << 30) | ((uint32_t)rxdcird << 12) | ((uint32_t)rxdcqrd << 0));
}

__INLINE void rc_rx_calib_en_unpack(uint8_t *rxcalen, uint8_t *rxcompen, uint16_t *rxdcird, uint16_t *rxdcqrd)
{
    uint32_t localVal = REG_PL_RD(RC_RX_CALIB_EN_ADDR);

    *rxcalen = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rxcompen = (localVal & ((uint32_t)0x40000000)) >> 30;
    *rxdcird = (localVal & ((uint32_t)0x00FFF000)) >> 12;
    *rxdcqrd = (localVal & ((uint32_t)0x00000FFF)) >> 0;
}

__INLINE uint8_t rc_rx_cal_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_CALIB_EN_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rc_rx_cal_en_setf(uint8_t rxcalen)
{
    ASSERT_ERR((((uint32_t)rxcalen << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(RC_RX_CALIB_EN_ADDR, (REG_PL_RD(RC_RX_CALIB_EN_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxcalen << 31));
}

__INLINE uint8_t rc_rx_comp_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_CALIB_EN_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void rc_rx_comp_en_setf(uint8_t rxcompen)
{
    ASSERT_ERR((((uint32_t)rxcompen << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_PL_WR(RC_RX_CALIB_EN_ADDR, (REG_PL_RD(RC_RX_CALIB_EN_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)rxcompen << 30));
}

__INLINE uint16_t rc_rx_dc_i_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_CALIB_EN_ADDR);
    return ((localVal & ((uint32_t)0x00FFF000)) >> 12);
}

__INLINE void rc_rx_dc_i_rd_setf(uint16_t rxdcird)
{
    ASSERT_ERR((((uint32_t)rxdcird << 12) & ~((uint32_t)0x00FFF000)) == 0);
    REG_PL_WR(RC_RX_CALIB_EN_ADDR, (REG_PL_RD(RC_RX_CALIB_EN_ADDR) & ~((uint32_t)0x00FFF000)) | ((uint32_t)rxdcird << 12));
}

__INLINE uint16_t rc_rx_dc_q_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_CALIB_EN_ADDR);
    return ((localVal & ((uint32_t)0x00000FFF)) >> 0);
}

__INLINE void rc_rx_dc_q_rd_setf(uint16_t rxdcqrd)
{
    ASSERT_ERR((((uint32_t)rxdcqrd << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_RX_CALIB_EN_ADDR, (REG_PL_RD(RC_RX_CALIB_EN_ADDR) & ~((uint32_t)0x00000FFF)) | ((uint32_t)rxdcqrd << 0));
}

/**
 * @brief RX_ERROR_RD register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16        RX_AMP_ERR_RD   0x0
 *  09:00      RX_PHASE_ERR_RD   0x0
 * </pre>
 */
#define RC_RX_ERROR_RD_ADDR   0x010500FC
#define RC_RX_ERROR_RD_OFFSET 0x000000FC
#define RC_RX_ERROR_RD_INDEX  0x0000003F
#define RC_RX_ERROR_RD_RESET  0x00000000

__INLINE uint32_t rc_rx_error_rd_get(void)
{
    return REG_PL_RD(RC_RX_ERROR_RD_ADDR);
}

// field definitions
#define RC_RX_AMP_ERR_RD_MASK     ((uint32_t)0x03FF0000)
#define RC_RX_AMP_ERR_RD_LSB      16
#define RC_RX_AMP_ERR_RD_WIDTH    ((uint32_t)0x0000000A)
#define RC_RX_PHASE_ERR_RD_MASK   ((uint32_t)0x000003FF)
#define RC_RX_PHASE_ERR_RD_LSB    0
#define RC_RX_PHASE_ERR_RD_WIDTH  ((uint32_t)0x0000000A)

#define RC_RX_AMP_ERR_RD_RST      0x0
#define RC_RX_PHASE_ERR_RD_RST    0x0

__INLINE void rc_rx_error_rd_unpack(uint16_t *rxamperrrd, uint16_t *rxphaseerrrd)
{
    uint32_t localVal = REG_PL_RD(RC_RX_ERROR_RD_ADDR);

    *rxamperrrd = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *rxphaseerrrd = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rc_rx_amp_err_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_ERROR_RD_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE uint16_t rc_rx_phase_err_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_ERROR_RD_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief RX_TY2_RD register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00            RX_TY2_RD   0x0
 * </pre>
 */
#define RC_RX_TY2_RD_ADDR   0x01050100
#define RC_RX_TY2_RD_OFFSET 0x00000100
#define RC_RX_TY2_RD_INDEX  0x00000040
#define RC_RX_TY2_RD_RESET  0x00000000

