china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
__INLINE uint32_t rc_rx_ty2_rd_get(void)
{
    return REG_PL_RD(RC_RX_TY2_RD_ADDR);
}

// field definitions
#define RC_RX_TY2_RD_MASK   ((uint32_t)0x000003FF)
#define RC_RX_TY2_RD_LSB    0
#define RC_RX_TY2_RD_WIDTH  ((uint32_t)0x0000000A)

#define RC_RX_TY2_RD_RST    0x0

__INLINE uint16_t rc_rx_ty2_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_TY2_RD_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief RX_DC_WR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:12           RX_DC_I_WR   0x800
 *  11:00           RX_DC_Q_WR   0x0
 * </pre>
 */
#define RC_RX_DC_WR_ADDR   0x01050104
#define RC_RX_DC_WR_OFFSET 0x00000104
#define RC_RX_DC_WR_INDEX  0x00000041
#define RC_RX_DC_WR_RESET  0x00800000

__INLINE uint32_t rc_rx_dc_wr_get(void)
{
    return REG_PL_RD(RC_RX_DC_WR_ADDR);
}

__INLINE void rc_rx_dc_wr_set(uint32_t value)
{
    REG_PL_WR(RC_RX_DC_WR_ADDR, value);
}

// field definitions
#define RC_RX_DC_I_WR_MASK   ((uint32_t)0x00FFF000)
#define RC_RX_DC_I_WR_LSB    12
#define RC_RX_DC_I_WR_WIDTH  ((uint32_t)0x0000000C)
#define RC_RX_DC_Q_WR_MASK   ((uint32_t)0x00000FFF)
#define RC_RX_DC_Q_WR_LSB    0
#define RC_RX_DC_Q_WR_WIDTH  ((uint32_t)0x0000000C)

#define RC_RX_DC_I_WR_RST    0x800
#define RC_RX_DC_Q_WR_RST    0x0

__INLINE void rc_rx_dc_wr_pack(uint16_t rxdciwr, uint16_t rxdcqwr)
{
    ASSERT_ERR((((uint32_t)rxdciwr << 12) & ~((uint32_t)0x00FFF000)) == 0);
    ASSERT_ERR((((uint32_t)rxdcqwr << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_RX_DC_WR_ADDR,  ((uint32_t)rxdciwr << 12) | ((uint32_t)rxdcqwr << 0));
}

__INLINE void rc_rx_dc_wr_unpack(uint16_t *rxdciwr, uint16_t *rxdcqwr)
{
    uint32_t localVal = REG_PL_RD(RC_RX_DC_WR_ADDR);

    *rxdciwr = (localVal & ((uint32_t)0x00FFF000)) >> 12;
    *rxdcqwr = (localVal & ((uint32_t)0x00000FFF)) >> 0;
}

__INLINE uint16_t rc_rx_dc_i_wr_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_DC_WR_ADDR);
    return ((localVal & ((uint32_t)0x00FFF000)) >> 12);
}

__INLINE void rc_rx_dc_i_wr_setf(uint16_t rxdciwr)
{
    ASSERT_ERR((((uint32_t)rxdciwr << 12) & ~((uint32_t)0x00FFF000)) == 0);
    REG_PL_WR(RC_RX_DC_WR_ADDR, (REG_PL_RD(RC_RX_DC_WR_ADDR) & ~((uint32_t)0x00FFF000)) | ((uint32_t)rxdciwr << 12));
}

__INLINE uint16_t rc_rx_dc_q_wr_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_DC_WR_ADDR);
    return ((localVal & ((uint32_t)0x00000FFF)) >> 0);
}

__INLINE void rc_rx_dc_q_wr_setf(uint16_t rxdcqwr)
{
    ASSERT_ERR((((uint32_t)rxdcqwr << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_RX_DC_WR_ADDR, (REG_PL_RD(RC_RX_DC_WR_ADDR) & ~((uint32_t)0x00000FFF)) | ((uint32_t)rxdcqwr << 0));
}

/**
 * @brief RX_ERROR_WR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16        RX_AMP_ERR_WR   0x200
 *  09:00      RX_PHASE_ERR_WR   0x200
 * </pre>
 */
#define RC_RX_ERROR_WR_ADDR   0x01050108
#define RC_RX_ERROR_WR_OFFSET 0x00000108
#define RC_RX_ERROR_WR_INDEX  0x00000042
#define RC_RX_ERROR_WR_RESET  0x02000200

__INLINE uint32_t rc_rx_error_wr_get(void)
{
    return REG_PL_RD(RC_RX_ERROR_WR_ADDR);
}

__INLINE void rc_rx_error_wr_set(uint32_t value)
{
    REG_PL_WR(RC_RX_ERROR_WR_ADDR, value);
}

// field definitions
#define RC_RX_AMP_ERR_WR_MASK     ((uint32_t)0x03FF0000)
#define RC_RX_AMP_ERR_WR_LSB      16
#define RC_RX_AMP_ERR_WR_WIDTH    ((uint32_t)0x0000000A)
#define RC_RX_PHASE_ERR_WR_MASK   ((uint32_t)0x000003FF)
#define RC_RX_PHASE_ERR_WR_LSB    0
#define RC_RX_PHASE_ERR_WR_WIDTH  ((uint32_t)0x0000000A)

#define RC_RX_AMP_ERR_WR_RST      0x200
#define RC_RX_PHASE_ERR_WR_RST    0x200

__INLINE void rc_rx_error_wr_pack(uint16_t rxamperrwr, uint16_t rxphaseerrwr)
{
    ASSERT_ERR((((uint32_t)rxamperrwr << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)rxphaseerrwr << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_RX_ERROR_WR_ADDR,  ((uint32_t)rxamperrwr << 16) | ((uint32_t)rxphaseerrwr << 0));
}

__INLINE void rc_rx_error_wr_unpack(uint16_t *rxamperrwr, uint16_t *rxphaseerrwr)
{
    uint32_t localVal = REG_PL_RD(RC_RX_ERROR_WR_ADDR);

    *rxamperrwr = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *rxphaseerrwr = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rc_rx_amp_err_wr_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_ERROR_WR_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void rc_rx_amp_err_wr_setf(uint16_t rxamperrwr)
{
    ASSERT_ERR((((uint32_t)rxamperrwr << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_PL_WR(RC_RX_ERROR_WR_ADDR, (REG_PL_RD(RC_RX_ERROR_WR_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)rxamperrwr << 16));
}

__INLINE uint16_t rc_rx_phase_err_wr_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_ERROR_WR_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rc_rx_phase_err_wr_setf(uint16_t rxphaseerrwr)
{
    ASSERT_ERR((((uint32_t)rxphaseerrwr << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_RX_ERROR_WR_ADDR, (REG_PL_RD(RC_RX_ERROR_WR_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxphaseerrwr << 0));
}

/**
 * @brief TX_MODE_CFG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:30         TEST_PATTERN   0x0
 *  25:16              I_CONST   0x200
 *  09:00              Q_CONST   0x200
 * </pre>
 */
#define RC_TX_MODE_CFG_ADDR   0x01050130
#define RC_TX_MODE_CFG_OFFSET 0x00000130
#define RC_TX_MODE_CFG_INDEX  0x0000004C
#define RC_TX_MODE_CFG_RESET  0x02000200

__INLINE uint32_t rc_tx_mode_cfg_get(void)
{
    return REG_PL_RD(RC_TX_MODE_CFG_ADDR);
}

__INLINE void rc_tx_mode_cfg_set(uint32_t value)
{
    REG_PL_WR(RC_TX_MODE_CFG_ADDR, value);
}

// field definitions
#define RC_TEST_PATTERN_MASK   ((uint32_t)0xC0000000)
#define RC_TEST_PATTERN_LSB    30
#define RC_TEST_PATTERN_WIDTH  ((uint32_t)0x00000002)
#define RC_I_CONST_MASK        ((uint32_t)0x03FF0000)
#define RC_I_CONST_LSB         16
#define RC_I_CONST_WIDTH       ((uint32_t)0x0000000A)
#define RC_Q_CONST_MASK        ((uint32_t)0x000003FF)
#define RC_Q_CONST_LSB         0
#define RC_Q_CONST_WIDTH       ((uint32_t)0x0000000A)

#define RC_TEST_PATTERN_RST    0x0
#define RC_I_CONST_RST         0x200
#define RC_Q_CONST_RST         0x200

__INLINE void rc_tx_mode_cfg_pack(uint8_t testpattern, uint16_t iconst, uint16_t qconst)
{
    ASSERT_ERR((((uint32_t)testpattern << 30) & ~((uint32_t)0xC0000000)) == 0);
    ASSERT_ERR((((uint32_t)iconst << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)qconst << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_MODE_CFG_ADDR,  ((uint32_t)testpattern << 30) | ((uint32_t)iconst << 16) | ((uint32_t)qconst << 0));
}

__INLINE void rc_tx_mode_cfg_unpack(uint8_t *testpattern, uint16_t *iconst, uint16_t *qconst)
{
    uint32_t localVal = REG_PL_RD(RC_TX_MODE_CFG_ADDR);

    *testpattern = (localVal & ((uint32_t)0xC0000000)) >> 30;
    *iconst = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *qconst = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

