china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
__INLINE uint8_t rc_test_pattern_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_MODE_CFG_ADDR);
    return ((localVal & ((uint32_t)0xC0000000)) >> 30);
}

__INLINE void rc_test_pattern_setf(uint8_t testpattern)
{
    ASSERT_ERR((((uint32_t)testpattern << 30) & ~((uint32_t)0xC0000000)) == 0);
    REG_PL_WR(RC_TX_MODE_CFG_ADDR, (REG_PL_RD(RC_TX_MODE_CFG_ADDR) & ~((uint32_t)0xC0000000)) | ((uint32_t)testpattern << 30));
}

__INLINE uint16_t rc_i_const_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_MODE_CFG_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void rc_i_const_setf(uint16_t iconst)
{
    ASSERT_ERR((((uint32_t)iconst << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_PL_WR(RC_TX_MODE_CFG_ADDR, (REG_PL_RD(RC_TX_MODE_CFG_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)iconst << 16));
}

__INLINE uint16_t rc_q_const_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_MODE_CFG_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rc_q_const_setf(uint16_t qconst)
{
    ASSERT_ERR((((uint32_t)qconst << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_MODE_CFG_ADDR, (REG_PL_RD(RC_TX_MODE_CFG_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)qconst << 0));
}

/**
 * @brief TX_SIN_CFG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22             TX_SIN_F   0x0
 *  17:16          TX_SIN_MODE   0x0
 *  15:12           TX_SIN_AMP   0x0
 * </pre>
 */
#define RC_TX_SIN_CFG_ADDR   0x01050134
#define RC_TX_SIN_CFG_OFFSET 0x00000134
#define RC_TX_SIN_CFG_INDEX  0x0000004D
#define RC_TX_SIN_CFG_RESET  0x00000000

__INLINE uint32_t rc_tx_sin_cfg_get(void)
{
    return REG_PL_RD(RC_TX_SIN_CFG_ADDR);
}

__INLINE void rc_tx_sin_cfg_set(uint32_t value)
{
    REG_PL_WR(RC_TX_SIN_CFG_ADDR, value);
}

// field definitions
#define RC_TX_SIN_F_MASK      ((uint32_t)0xFFC00000)
#define RC_TX_SIN_F_LSB       22
#define RC_TX_SIN_F_WIDTH     ((uint32_t)0x0000000A)
#define RC_TX_SIN_MODE_MASK   ((uint32_t)0x00030000)
#define RC_TX_SIN_MODE_LSB    16
#define RC_TX_SIN_MODE_WIDTH  ((uint32_t)0x00000002)
#define RC_TX_SIN_AMP_MASK    ((uint32_t)0x0000F000)
#define RC_TX_SIN_AMP_LSB     12
#define RC_TX_SIN_AMP_WIDTH   ((uint32_t)0x00000004)

#define RC_TX_SIN_F_RST       0x0
#define RC_TX_SIN_MODE_RST    0x0
#define RC_TX_SIN_AMP_RST     0x0

__INLINE void rc_tx_sin_cfg_pack(uint16_t txsinf, uint8_t txsinmode, uint8_t txsinamp)
{
    ASSERT_ERR((((uint32_t)txsinf << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txsinmode << 16) & ~((uint32_t)0x00030000)) == 0);
    ASSERT_ERR((((uint32_t)txsinamp << 12) & ~((uint32_t)0x0000F000)) == 0);
    REG_PL_WR(RC_TX_SIN_CFG_ADDR,  ((uint32_t)txsinf << 22) | ((uint32_t)txsinmode << 16) | ((uint32_t)txsinamp << 12));
}

__INLINE void rc_tx_sin_cfg_unpack(uint16_t *txsinf, uint8_t *txsinmode, uint8_t *txsinamp)
{
    uint32_t localVal = REG_PL_RD(RC_TX_SIN_CFG_ADDR);

    *txsinf = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txsinmode = (localVal & ((uint32_t)0x00030000)) >> 16;
    *txsinamp = (localVal & ((uint32_t)0x0000F000)) >> 12;
}

__INLINE uint16_t rc_tx_sin_f_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_SIN_CFG_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rc_tx_sin_f_setf(uint16_t txsinf)
{
    ASSERT_ERR((((uint32_t)txsinf << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_PL_WR(RC_TX_SIN_CFG_ADDR, (REG_PL_RD(RC_TX_SIN_CFG_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txsinf << 22));
}

__INLINE uint8_t rc_tx_sin_mode_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_SIN_CFG_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__INLINE void rc_tx_sin_mode_setf(uint8_t txsinmode)
{
    ASSERT_ERR((((uint32_t)txsinmode << 16) & ~((uint32_t)0x00030000)) == 0);
    REG_PL_WR(RC_TX_SIN_CFG_ADDR, (REG_PL_RD(RC_TX_SIN_CFG_ADDR) & ~((uint32_t)0x00030000)) | ((uint32_t)txsinmode << 16));
}

__INLINE uint8_t rc_tx_sin_amp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_SIN_CFG_ADDR);
    return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

__INLINE void rc_tx_sin_amp_setf(uint8_t txsinamp)
{
    ASSERT_ERR((((uint32_t)txsinamp << 12) & ~((uint32_t)0x0000F000)) == 0);
    REG_PL_WR(RC_TX_SIN_CFG_ADDR, (REG_PL_RD(RC_TX_SIN_CFG_ADDR) & ~((uint32_t)0x0000F000)) | ((uint32_t)txsinamp << 12));
}

/**
 * @brief TX_DC_COMP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16         TX_I_DC_COMP   0x200
 *  09:00         TX_Q_DC_COMP   0x200
 * </pre>
 */
#define RC_TX_DC_COMP_ADDR   0x0105013C
#define RC_TX_DC_COMP_OFFSET 0x0000013C
#define RC_TX_DC_COMP_INDEX  0x0000004F
#define RC_TX_DC_COMP_RESET  0x02000200

__INLINE uint32_t rc_tx_dc_comp_get(void)
{
    return REG_PL_RD(RC_TX_DC_COMP_ADDR);
}

__INLINE void rc_tx_dc_comp_set(uint32_t value)
{
    REG_PL_WR(RC_TX_DC_COMP_ADDR, value);
}

// field definitions
#define RC_TX_I_DC_COMP_MASK   ((uint32_t)0x03FF0000)
#define RC_TX_I_DC_COMP_LSB    16
#define RC_TX_I_DC_COMP_WIDTH  ((uint32_t)0x0000000A)
#define RC_TX_Q_DC_COMP_MASK   ((uint32_t)0x000003FF)
#define RC_TX_Q_DC_COMP_LSB    0
#define RC_TX_Q_DC_COMP_WIDTH  ((uint32_t)0x0000000A)

#define RC_TX_I_DC_COMP_RST    0x200
#define RC_TX_Q_DC_COMP_RST    0x200

__INLINE void rc_tx_dc_comp_pack(uint16_t txidccomp, uint16_t txqdccomp)
{
    ASSERT_ERR((((uint32_t)txidccomp << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)txqdccomp << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_DC_COMP_ADDR,  ((uint32_t)txidccomp << 16) | ((uint32_t)txqdccomp << 0));
}

__INLINE void rc_tx_dc_comp_unpack(uint16_t *txidccomp, uint16_t *txqdccomp)
{
    uint32_t localVal = REG_PL_RD(RC_TX_DC_COMP_ADDR);

    *txidccomp = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *txqdccomp = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rc_tx_i_dc_comp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_DC_COMP_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void rc_tx_i_dc_comp_setf(uint16_t txidccomp)
{
    ASSERT_ERR((((uint32_t)txidccomp << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_PL_WR(RC_TX_DC_COMP_ADDR, (REG_PL_RD(RC_TX_DC_COMP_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)txidccomp << 16));
}

__INLINE uint16_t rc_tx_q_dc_comp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_DC_COMP_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rc_tx_q_dc_comp_setf(uint16_t txqdccomp)
{
    ASSERT_ERR((((uint32_t)txqdccomp << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_DC_COMP_ADDR, (REG_PL_RD(RC_TX_DC_COMP_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txqdccomp << 0));
}

/**
 * @brief TX_GAIN_COMP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16       TX_I_GAIN_COMP   0x3FF
 *  09:00       TX_Q_GAIN_COMP   0x3FF
 * </pre>
 */
#define RC_TX_GAIN_COMP_ADDR   0x01050140
#define RC_TX_GAIN_COMP_OFFSET 0x00000140
#define RC_TX_GAIN_COMP_INDEX  0x00000050
#define RC_TX_GAIN_COMP_RESET  0x03FF03FF

__INLINE uint32_t rc_tx_gain_comp_get(void)
{
    return REG_PL_RD(RC_TX_GAIN_COMP_ADDR);
}

__INLINE void rc_tx_gain_comp_set(uint32_t value)
{
    REG_PL_WR(RC_TX_GAIN_COMP_ADDR, value);
}

