china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_rc.h
// field definitions
#define RC_TX_I_GAIN_COMP_MASK   ((uint32_t)0x03FF0000)
#define RC_TX_I_GAIN_COMP_LSB    16
#define RC_TX_I_GAIN_COMP_WIDTH  ((uint32_t)0x0000000A)
#define RC_TX_Q_GAIN_COMP_MASK   ((uint32_t)0x000003FF)
#define RC_TX_Q_GAIN_COMP_LSB    0
#define RC_TX_Q_GAIN_COMP_WIDTH  ((uint32_t)0x0000000A)

#define RC_TX_I_GAIN_COMP_RST    0x3FF
#define RC_TX_Q_GAIN_COMP_RST    0x3FF

__INLINE void rc_tx_gain_comp_pack(uint16_t txigaincomp, uint16_t txqgaincomp)
{
    ASSERT_ERR((((uint32_t)txigaincomp << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)txqgaincomp << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_GAIN_COMP_ADDR,  ((uint32_t)txigaincomp << 16) | ((uint32_t)txqgaincomp << 0));
}

__INLINE void rc_tx_gain_comp_unpack(uint16_t *txigaincomp, uint16_t *txqgaincomp)
{
    uint32_t localVal = REG_PL_RD(RC_TX_GAIN_COMP_ADDR);

    *txigaincomp = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *txqgaincomp = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rc_tx_i_gain_comp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_GAIN_COMP_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void rc_tx_i_gain_comp_setf(uint16_t txigaincomp)
{
    ASSERT_ERR((((uint32_t)txigaincomp << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_PL_WR(RC_TX_GAIN_COMP_ADDR, (REG_PL_RD(RC_TX_GAIN_COMP_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)txigaincomp << 16));
}

__INLINE uint16_t rc_tx_q_gain_comp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_GAIN_COMP_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rc_tx_q_gain_comp_setf(uint16_t txqgaincomp)
{
    ASSERT_ERR((((uint32_t)txqgaincomp << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_GAIN_COMP_ADDR, (REG_PL_RD(RC_TX_GAIN_COMP_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txqgaincomp << 0));
}

/**
 * @brief TX_PHASE_TY2_COMP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16        TX_PHASE_COMP   0x200
 *  09:00          TX_TY2_COMP   0x200
 * </pre>
 */
#define RC_TX_PHASE_TY2_COMP_ADDR   0x01050144
#define RC_TX_PHASE_TY2_COMP_OFFSET 0x00000144
#define RC_TX_PHASE_TY2_COMP_INDEX  0x00000051
#define RC_TX_PHASE_TY2_COMP_RESET  0x02000200

__INLINE uint32_t rc_tx_phase_ty2_comp_get(void)
{
    return REG_PL_RD(RC_TX_PHASE_TY2_COMP_ADDR);
}

__INLINE void rc_tx_phase_ty2_comp_set(uint32_t value)
{
    REG_PL_WR(RC_TX_PHASE_TY2_COMP_ADDR, value);
}

// field definitions
#define RC_TX_PHASE_COMP_MASK   ((uint32_t)0x03FF0000)
#define RC_TX_PHASE_COMP_LSB    16
#define RC_TX_PHASE_COMP_WIDTH  ((uint32_t)0x0000000A)
#define RC_TX_TY2_COMP_MASK     ((uint32_t)0x000003FF)
#define RC_TX_TY2_COMP_LSB      0
#define RC_TX_TY2_COMP_WIDTH    ((uint32_t)0x0000000A)

#define RC_TX_PHASE_COMP_RST    0x200
#define RC_TX_TY2_COMP_RST      0x200

__INLINE void rc_tx_phase_ty2_comp_pack(uint16_t txphasecomp, uint16_t txty2comp)
{
    ASSERT_ERR((((uint32_t)txphasecomp << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)txty2comp << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_PHASE_TY2_COMP_ADDR,  ((uint32_t)txphasecomp << 16) | ((uint32_t)txty2comp << 0));
}

__INLINE void rc_tx_phase_ty2_comp_unpack(uint16_t *txphasecomp, uint16_t *txty2comp)
{
    uint32_t localVal = REG_PL_RD(RC_TX_PHASE_TY2_COMP_ADDR);

    *txphasecomp = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *txty2comp = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rc_tx_phase_comp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_PHASE_TY2_COMP_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void rc_tx_phase_comp_setf(uint16_t txphasecomp)
{
    ASSERT_ERR((((uint32_t)txphasecomp << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_PL_WR(RC_TX_PHASE_TY2_COMP_ADDR, (REG_PL_RD(RC_TX_PHASE_TY2_COMP_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)txphasecomp << 16));
}

__INLINE uint16_t rc_tx_ty2_comp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_PHASE_TY2_COMP_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rc_tx_ty2_comp_setf(uint16_t txty2comp)
{
    ASSERT_ERR((((uint32_t)txty2comp << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TX_PHASE_TY2_COMP_ADDR, (REG_PL_RD(RC_TX_PHASE_TY2_COMP_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txty2comp << 0));
}

/**
 * @brief TX_OTHER_CFG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31           TX_IQ_SWAP   0
 *  30:21     IQ_CONSTANT_POUT   0x0
 *  19:16          TX_PRE_GAIN   0x0
 *  15:06   IQ_CONSTANT_IQCAL_P   0x0
 * </pre>
 */
#define RC_TX_OTHER_CFG_ADDR   0x01050148
#define RC_TX_OTHER_CFG_OFFSET 0x00000148
#define RC_TX_OTHER_CFG_INDEX  0x00000052
#define RC_TX_OTHER_CFG_RESET  0x00000000

__INLINE uint32_t rc_tx_other_cfg_get(void)
{
    return REG_PL_RD(RC_TX_OTHER_CFG_ADDR);
}

__INLINE void rc_tx_other_cfg_set(uint32_t value)
{
    REG_PL_WR(RC_TX_OTHER_CFG_ADDR, value);
}

// field definitions
#define RC_TX_IQ_SWAP_BIT             ((uint32_t)0x80000000)
#define RC_TX_IQ_SWAP_POS             31
#define RC_IQ_CONSTANT_POUT_MASK      ((uint32_t)0x7FE00000)
#define RC_IQ_CONSTANT_POUT_LSB       21
#define RC_IQ_CONSTANT_POUT_WIDTH     ((uint32_t)0x0000000A)
#define RC_TX_PRE_GAIN_MASK           ((uint32_t)0x000F0000)
#define RC_TX_PRE_GAIN_LSB            16
#define RC_TX_PRE_GAIN_WIDTH          ((uint32_t)0x00000004)
#define RC_IQ_CONSTANT_IQCAL_P_MASK   ((uint32_t)0x0000FFC0)
#define RC_IQ_CONSTANT_IQCAL_P_LSB    6
#define RC_IQ_CONSTANT_IQCAL_P_WIDTH  ((uint32_t)0x0000000A)

#define RC_TX_IQ_SWAP_RST             0x0
#define RC_IQ_CONSTANT_POUT_RST       0x0
#define RC_TX_PRE_GAIN_RST            0x0
#define RC_IQ_CONSTANT_IQCAL_P_RST    0x0

__INLINE void rc_tx_other_cfg_pack(uint8_t txiqswap, uint16_t iqconstantpout, uint8_t txpregain, uint16_t iqconstantiqcalp)
{
    ASSERT_ERR((((uint32_t)txiqswap << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)iqconstantpout << 21) & ~((uint32_t)0x7FE00000)) == 0);
    ASSERT_ERR((((uint32_t)txpregain << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)iqconstantiqcalp << 6) & ~((uint32_t)0x0000FFC0)) == 0);
    REG_PL_WR(RC_TX_OTHER_CFG_ADDR,  ((uint32_t)txiqswap << 31) | ((uint32_t)iqconstantpout << 21) | ((uint32_t)txpregain << 16) | ((uint32_t)iqconstantiqcalp << 6));
}

__INLINE void rc_tx_other_cfg_unpack(uint8_t *txiqswap, uint16_t *iqconstantpout, uint8_t *txpregain, uint16_t *iqconstantiqcalp)
{
    uint32_t localVal = REG_PL_RD(RC_TX_OTHER_CFG_ADDR);

